In [1]:
import csv

In [2]:
reader = csv.reader(open('birth-rate.csv', 'r'), delimiter = ",")

In [3]:
# rowsSoFar = 0
# print('year,rate')
# for row in reader:
#     if rowsSoFar == 0:
#         header = row
#         rowsSoFar +=1
#     else:
#         for i in range(len(row)):
#             if i > 0 and row[i]:
#                 print(header[i] + ',' + row[i])
#         rowsSoFar += 1

In [4]:
# python transform-birth-rate.py > birth-rate-yearly.csv

In [5]:
type(reader)

_csv.reader

In [6]:
import pandas as pd

In [7]:
birthDF = pd.read_csv('birth-rate.csv')

In [8]:
birthDF.head()

,Country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008
0,Aruba,36.400,35.179,33.863,32.459,30.994,29.513,28.069,26.721,25.518,...,15.024,14.528,14.041,13.579,13.153,12.772,12.441,12.159,11.919,11.716
1,Afghanistan,52.201,52.206,52.208,52.204,52.192,52.168,52.130,52.076,52.006,...,51.229,50.903,50.486,49.984,49.416,48.803,48.177,47.575,47.023,46.538
2,Angola,54.432,54.394,54.317,54.199,54.040,53.836,53.585,53.296,52.984,...,48.662,48.355,48.005,47.545,46.936,46.184,45.330,44.444,43.607,42.875
3,Albania,40.886,40.312,39.604,38.792,37.913,37.008,36.112,35.245,34.421,...,17.713,16.850,16.081,15.444,14.962,14.644,14.485,14.464,14.534,14.649
4,Netherlands Antilles,32.321,30.987,29.618,28.229,26.849,25.518,24.280,23.173,22.230,...,15.809,15.412,15.096,14.824,14.565,14.309,14.051,13.790,13.532,13.281

In [9]:
birthDF.columns[1:]

Index(['1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968',
       '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977',
       '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986',
       '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995',
       '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004',
       '2005', '2006', '2007', '2008'],
      dtype='object')

In [10]:
# tuple(birthDF.columns[1:])

In [11]:
meltedDF = birthDF.melt(id_vars=['Country'], var_name='Year', value_name='Rate')
meltedDF

                    Country  Year    Rate
0                     Aruba  1960  36.400
1               Afghanistan  1960  52.201
2                    Angola  1960  54.432
3                   Albania  1960  40.886
4      Netherlands Antilles  1960  32.321
...                     ...   ...     ...
11461                 Samoa  2008  23.508
11462           Yemen, Rep.  2008  36.795
11463          South Africa  2008  22.038
11464                Zambia  2008  42.879
11465              Zimbabwe  2008  29.930

[11466 rows x 3 columns]

In [12]:
yearRate = pd.DataFrame()

In [13]:
yearRate['Year'] = meltedDF['Year']
yearRate['Rate'] = meltedDF['Rate']

In [14]:
yearRate.to_csv('birth-rate-yearly.csv', index=False)

In [15]:
yearRate.head()

   Year    Rate
0  1960  36.400
1  1960  52.201
2  1960  54.432
3  1960  40.886
4  1960  32.321